<template>
	<view class="main">

		<view class="btn">
			<view class="btns">
				<u-button customStyle="margin-right:10rpx" size="small" text="放大" @click="fontSizeHandle('big')"></u-button>
				<u-button size="small" type="primary" text=" 缩小" @click="fontSizeHandle('small')"></u-button>
			</view>
		</view>
		<view :style="{'font-size':fontSize+'rpx'}">
			<pre>
餐修用户端用户隐私政策

杭州餐修科技有限公司（以下简称“我们”）深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。 请在使用我们的产品（或服务）前，仔细阅读并了解本《隐私权政策》。
本《隐私政策》将帮助您了解以下内容：
一、个人信息界定
二、我们如何收集和使用您的个人信息
三、我们如何共享、转让、公开披露您的个人信息
四、我们如何使用 Cookies 和同类技术
五、我们如何储存和保存您的个人信息
六、未成年人保护
七、您对个人信息享有的控制权
八、本政策的更新与通知
九、如何联系我们
一、个人信息界定
1、个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私政策中涉及的个人信息包括：基本信息（包括个人姓名、生日、性别、门店地址、个人电话号码）；网络身份识别信息（包括平台登录账号、 IP 地址）；个人财产信息（交易和消费记录、优惠券、会员卡等虚拟财产信息）；通讯录；个人上网记录（包括网站浏览记录、软件使用记录、点击记录）；个人常用设备信息（包括硬件型号、设备 MAC 地址、操作系统类型、软件 安装 列表 、 唯一设备识别码（如 IMEI/Android ID/IDFA/OPENUDID/GUID 、 SIM 卡 IMSI 信息等在内的描述个人常用设备基本情况的信息）；个人位置信息（精准定位信息、经纬度等）；
2、个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。通常情况下，14岁以下（含）儿童的个人信息和涉及自然人隐私的信息属于个人敏感信息。本隐私政策中涉及的个人敏感信息包括：基本信息 （ 个人电话号码 ）、 个人财产信息 、 网络身份识别信息（包括账户名）；其他信息（包括通讯录、网页浏览记录、精准定位信息）。
二、我们如何收集使用您的个人信息
我们深知个人信息对您的重要性,并会尽全力保护您的个人信息安全可靠。餐修用户端服务的目标是为用户提供安全、舒适、便捷报修服务体验，我们收集使用您的个人信息，主要是为了实现这一目标。
您在使用我们的产品及/或服务前请务必仔细阅读并确认您已经充分理解本政策所写明的内容,以保证您可以按照本隐私政策的指引做出您认为适当的选择。
您使用或在我们更新本隐私政策后（餐修会及时提示您更新的情况）继续使用我们的产品及/或服务,即意味着您同意我们按照本隐私政策及更新版本约定收集、使用、保存和共享您的相关信息。
其次，本应用允许通过通知栏相关通知或其他相关链接进行应用唤醒启动。
餐修遵循合法、合理及服务用户的原则,出于本政策所述的以下目的,收集和使用您在使用服务过程中主动提供或产生的个人信息,帮助您成为我们的用户,向您提供产品及/或服务,改进我们的产品及/或服务及其他用途，以期为您优化用户体验并提供安全保障。
1，我们会出于以下目的，收集和使用您的个人信息。
（1）您须授权我们收集和使用您个人信息的情形
我们的产品与或服务包括核心业务功能和附加功能。我们的产品与  或服务包括一些核心功能，这些功能包含了实现线上报修所必须的功能、改进我们的产品与 或服务所必须的功能及保障交易安全所必须的功能。我们可能会收集、保存和使用与您有关的信息才能实现上述这些功能。如果您不提供相关信息，您将无法使用我们提供的产品与 或服务。这些功能包括：
1 ） 实现线上报修所必须的功能
① 帮助您完成注册 / 登录
当你注册餐修用户端账户及你在使用餐修客户端提供的相关服务时填写及/或提交的信息，您需要至少向我们提供您准备使用的包括但不仅限于您本人的手机号码、性别、头像等相关信息以创建账号，我们将通过发送短信验证码来验证您的身份是否有效。在提供个人信息的过程中，如果您愿意额外补充如下个人信息，将有助于我们向您提供有针对性的服务，包括您的门店头像、门店名称、门店地址、详细地址。如果您不提供该等信息，不会影响您享受餐修客户端服务的基本功能。
② 为您展示、推送和搜索商品信息或服务
为了让您快速地找到您所需要的商品，我们可能会收集您使用我们提供的产品与 / 或服务的设备信息（ 包含设备识别码 IMEI/MAC/Android ID/IDFA/OpenUDID/GUID/SIM 卡 / 移动用户设备码 IMSI/ 设备型号 / 操作系统 / 应用程序版本 / 语言设置 / 分辨率 /IP 地址 / 浏览器类型 / 地理位置等）来为您提供商品信息展示、搜索的最优方式 , 通过短信、移动 push 精准推送您所需要的商品或服务，告知重大活动信息。 我们也会为了不断改进和优化上述的功能来使用您的上述个人信息。
通过搜索来精准地找到您所需要的商品或服务。我们会保留您的搜索内容以方便您重复输入或为您展示与您搜索内容相关联的商品。
请您注意，单独的设备信息、浏览器类型、日志信息或搜索关键词信息无法识别您的身份，不属于您的个人信息，我们有权以任何的目的对其进行使用 ；只有将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，我们会将这类非个人信息视为个人信息，我们会将该类个人信息做去标识化、匿名化处理。

③ 为您提供加维修车及产品分享功能
在您使用餐修用户端服务的产品或服务期间，您可以选择对感兴趣的商品及 / 或服务添加至购物车、通过我们提供的功能组件向其他第三方分享信息。在您使用前述功能期间，我们会收集您的添加维修车记录、分享记录在内的日志信息用于实现前述功能及其他我们明确告知的目的。
④ 为您实现下单及订单管理
当你使用餐修用户端服务下单时，使用发布图片、音视频、上传文件时，我们会请求您授权储存、相机/相册、麦克风、位置WIFI状态、网络系统权限。这些均不会默认开启，只有经过您单独同意后，才会在为实现特定服务/功能时访问。您如果拒绝授权提供，我们将停止访问相应权限，将无法使用此功能，但不影响您正常使用其他功能。同时，请您注意，部分权限（如：设备权限、位置权限）可能会用于部分第三方应用（含小程序）服务，该等权限仅在您使用第三方应用特定功能时通过我们的产品与/或服务申请获取。
当您准备对您维修车内的商品进行结算时，平台会生成您购买该服务的订单。您需要在订单中至少填写您的联系人姓名、服务地址以及手机号码，同时该订单中会载明订单号、您所购买的商品或服务信息、您应支付的货款金额及支付方式。
我们需要根据商品/服务类型收集如下部分或全部的个人信息，包括：您的收货人信息（可能包括姓名、地址、联系电话、邮编、发票信息，若收货人非您本人的，您应当确保已经获得收货人相关授权）、交易商品/服务信息、订单编号、下单时间、订单金额、您的备注信息，
上述所有信息构成您的 “订单信息”，我们将使用您的订单信息来进行您的身份核验、确定交易、支付结算、完成服务、为您查询订单以及提供客服咨询与售后服务；我们还会使用您的订单信息来判断您的交易是否存在异常以保护您的交易安全。
请您注意，您在餐修用户端服务平台上产生的订单，将可能包括您的身份信息、联络信息、支付信息等，这些均属于敏感信息，请您谨慎向他人展示或对外提供。
餐修用户端应用权限申请及使用说明：
Android：
（一）、存储
权限名称：READ_EXTERNAL_STORAGE读取外置存储器
使用目的：读取您设备的外置存储器中您选定的图片/音视频内容等信息以实现头像上传/更换、内容发布等。
涉及信息：存储的文件
权限名称：WRITE_EXTERNAL_STORAGE写入外置存储器
使用目的：将App内的图片/音视频内容、缓存、崩溃日志等信息存储至您设备的外置存储空间等
涉及信息：存储的文件
适用范围：餐修用户端
（二）、相机/相册
权限名称：CAMERA拍摄
使用目的：获取您拍摄的图片/视频内容信息以实现头像上传/更换、内容发布等；扫描二维码，登录账号、进入活动等
涉及信息：图片/视频内容信息
适用范围：餐修用户端
（三）、麦克风
权限名称：READ_AUDIO录音
使用目的：录制音视频以实现内容发布等
涉及信息：语音信息
适用范围：餐修用户端
（四）、位置
权限名称：ACCESS_FINE_LOCATION访问精确地理位置信息
          ACCESS_COARSE_LOCATION访问粗略地理位置信息
使用目的：获取您的地理位置，为您提供上门服务提供正确的位置位置信息等
涉及信息：地理位置信息
适用范围：餐修用户端
（五）、网络
权限名称：INTERNET访问网络
使用目的：获取网络上的信息展示给用户
涉及信息：网络信息
适用范围：餐修用户端
（六）WIFI状态
权限名称：ACCESS_WIFI_STATE WIFI状态
使用目的：获取WIFI mac地址，以便正常提供统计分析服务
涉及信息：WIFI信息
适用范围：餐修用户端
iOS：
（一）、相册
权限名称：NSPhotoLibraryAddUsageDescription向相册中添加内容
使用目的：将App内的图片/音视频内容等信息存储至您设备的空间中
涉及信息：存储的文件
权限名称：NSPhotoLibraryUsageDescription读取相册中内容
使用目的：读取您设备相册中的您选定的图片/音视频内容等信息以实现头像上传/更换、内容发布等
涉及信息：存储的文件
适用范围：餐修用户端
（二）、相机
权限名称：NSCameraUsageDescription使用摄像头
使用目的：拍摄用户头像照片、拍摄完工照片、拍摄下单商品图片等
涉及信息：图片/视频内容信息
备注：不涉及任何个人信息回传、存储或与第三方共享
适用范围：餐修用户端
（三）、麦克风
权限名称：NSMicrophoneUsageDescription使用麦克风
使用目的：录制音视频以实现内容发布等；获取您的音频信息以实现语音留言、语音识别地址等
涉及信息：语音信息
适用范围：餐修用户端

（四）、设备标识信息

权限名称：NSUserTrackingUsageDescription读取设备标识
使用目的：为您提供内容与服务
涉及信息：广告标识符（IDFA）
适用范围：餐修用户端

（五）、位置

权限名称：NSLocationUsageDescription App访问地理位置
权限名称：NSLocationWhenInUseUsageDescription App在使用期间访问地理位置
权限名称：NSLocationAlwaysUsageDescription APP始终访问地理位置
使用目的：获取您的地理位置，在为您提供上门服务需要用到您的位置信息。
涉及信息：地理位置信息
适用范围：餐修用户端

说明示例（以IOS端相机权限为例）：
相机
权限名称：NSCameraUsageDescription使用摄像头
使用目的：相机以实现相片视频等内容发布等；获取您的相机以实现拍摄用户头像照片、拍摄完工照片、拍摄下单商品图片。
适用范围：餐修用户端
⑤ 为实现订单支付及交付的所必须进行的分享
为完成订单支付、保障交易安全，我们需要收集您的交易金额、下单时间、订单商户、订单编号、支付方式、支付账号、支付状态信息，并通过安全方式与支付机构（如微信、支付宝、银行等金融机构）进行前述部分或全部信息的共享。
当您在餐修用户端上进行订单支付时，您可以选择餐修用户端务合作的、以软件工具开发包（简称 “ SDK ”）方式嵌入的第三方支付机构（包括微信支付、支付宝，以下称“支付机构”）所提供的支付服务。我们需要收集您的餐修用户端订单信息、对账信息及其他法律要求的必要信息并与这些合作机构共享，以确认您的支付指令并帮助您完成支付。
SDK 名称：微信
SDK 包名： com.tencent.mm
SDK 用途：微信支付
获取的信息类型：存储的个人文件
调用的设备权限：读取外置存储器、写入外置存储器
官网链接：
https://weixin.qq.com/cgi-bin/readtemplate?lang=zh_CN&t=weixin_agreement&s=privacy
SDK 名称： 支付宝
SDK 包名： com.alipay
SDK 用途：支付宝支付
获取的信息类型：存储的个人文件
调用的设备权限：读取外置存储器、写入外置存储器、读取网络状态
官网链接：
https://render.alipay.com/p/c/k2cx0tg8

⑥ 实现服务咨询或评论功能
（1）咨询服务
在你使用餐修用户端服务时，通过向平台发起的订单咨询或客服订单咨询中选择发送音视频、图片等内容时，我们将收集您发布的信息，并展示您的昵称、头像、发布内容和信息。您如果拒绝提供上述授权，将无法使用此功能，但不影响您正常使用其他功能。
（2）评论服务
在你使用餐修用户端评论服务时，或进行评论时，我们将收集您发布的信息，并展示您的昵称、头像、发布内容和信息。如您不希望这些信息被发布，您可拒绝授权提供，您也将无法使用此功能，但不影响您正常使用其他功能。
⑦客服服务
除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而收集你的其他信息，包括你与我们的客户服务团队联系时你提供的相关信息，你参与问卷调查时向我们发送的问卷答复信息，以及你与餐修用户端的关联方、餐修用户端合作伙伴之间互动时我们收集的相关信息。
⑧改进我们的产品或服务所必须的功能
我们可能会直接或间接收集您的信息（例如您的订单信息、评价信息等、浏览信息、位置信息、 设备信息（包含设备识别码 IMEI/MAC/Android ID/IDFA/OpenUDID/GUID/IMSI/ 设备型号 / 操作系统 / 应用程序版本 /IP 地址 / 浏览器类型 / 地理位置等） ）
会根据您的设备 软件安装列表信息 信息和您使用我们的产品或服务时的浏览使用信息，提取您的偏好特征，并给予特征产出间接人群画像，用于展示、推送信息和可能的商业广告。 如果您不想接受我们给您发送的商业广告，您可通过短信提示回复退订或我们提供的其他方式进行退订或关闭
我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括但不仅限于您与客服联系时您提供的相关信息，对于从您的各种设备上收集到的信息，我们可能会将它们进行关联，以便我们能在这些设备上为您提供一致的服务。
⑨为保障交易安全所必须的功能
为保障您使用我们的产品或服务时系统的稳定性和安全性，防止您的个人信息被非法获取，更准确地预防欺诈和保护账号安全，我们需要收集您的设备信息（设备型号、设备Mac地址、应用进程列表、设备识别码、操作系统及软件版本、设备状态、网络状况）、历史上网记录、日志信息、IP地址、浏览信息、订单信息、常用软件列表、ssid、wifi信息、电池使用情况来判断您的账号风险，并可能会记录一些我们认为有风险的链接（“URL”）；我们也会收集您的设备信息用于对餐修系统问题进行分析、统计流量并排查可能存在的风险，在您选择向我们发送异常信息时予以排查。如果您不提供上述信息，我们则无法在您使用餐修服务过程中对您的服务及账号安全进行保护。
⑩自启动和关联启动说明
(1)为确保本应用处于关闭或后台运行状态下可正常接收到客户端推送的广播信息，本应用须使用(自启动)能力，将存在一定频率通过系统发送广播唤醒本应用自启动或关联启动行为，是因实现功能及服务所必要的。在征得您的明确同意后，会跳转餐修APP打开相关内容。在未征得您同意的情况下，则不会有关联启动。
(2)当您打开App内容类推送消息，在征得您的明确同意后，会跳转App打开相关内容。在未征得您同意的情况下，则不会有关联启动。
(3)在您未同意用户协议和隐私政策前，若您点击查看用户协议和隐私政策，为防止第三方SDK收集您的个人信息，我们会通过启动系统浏览器来供您查看用户协议和隐私政策。
(4)当您打开本App内部下载的文件后，会关联启动第三方App。在未征得您同意的情况下，则不会有关联启动。
2，向您提供产品与 / 或服务过程中我们主动收集的个人信息
我们的产品基于DCloud uni-app(5+ App/Wap2App)开发，应用运行期间需要收集您的设备唯一识别码（IMEI/android ID/DEVICE_ID/IDFA、SIM 卡 IMSI 信息、OAID）以提供统计分析服务，并通过应用启动数据及异常错误日志分析改进性能和用户体验，为用户提供更好的服务。详情内容请访问《DCloud用户服务条款》。（DCloud用户服务条款超链至：https://ask.dcloud.net.cn/protocol.html）
在符合法律法规的前提下，为了保障您的账号安全以及为您提供更优质的服务，我们会收集和使用您在使用 餐修用户端 产品与 / 或服务过程中产生的如下信息：
① 设备信息
为了进行统计分析、排查异常信息、为您提供一致的服务以及更好的用户体验，当您使用本平台时，我们会收集您的个人常用设备信息 ， 甚至可能在应用后台运营时获取 包括唯一设备识别码（ IDFA ）、 国际移动设备识别码（ IMEI ）、国际移动用户识别码（ IMSI ）、 设备类型、设备厂商、设备型号、屏幕尺寸、 AndroidID 、系统版本、设备位置（ IP 地址）、手机运营商、网络类型 、 软件安装列表等设备信息 ，并对这些设备唯一标识信息进行关联。
关于第三方 SDK 获取您个人信息的情况，我们向您清晰、简洁的介绍我们“餐修用户端”内嵌SDK清单及合作商第三方名单的情况。详细信息如下：
微信支付 SDK
涉及个人信息：设备标识符（Android如IMEI、Android ID、Serial）、MAC地址、WLAN接入点
使用目的：支持微信支付
使用场景：在用户使用微信支付时使用
合作方主体：财富通支付科技有限公司
收集方式：SDK采集
合作方官网链接：https://www.tenpay.com/v4/index.html
合作方隐私政策：https://www.tenpay.com/v3/helpcenter/low/privacy.shtml
Alipay（支付宝） SDK
涉及个人信息：设备标识符（Android如IMEI、MEID、IMSI、Android ID、Serial、ICCID，iOS如IDFV、IDFA）、MAC地址、IP地址、WLAN接入点、设备传感器数据
使用目的：帮助用户在应用内使用支付宝
使用场景：在用户使用支付宝支付时使用
合作方主体：支付宝（杭州）信息技术有限公司
收集方式：SDK采集
合作方官网链接：https://render.alipay.com/p/f/fd-iwwyijeh/index.html
合作方隐私政策：https://docs.open.alipay.com/54
高德地图 SDK

使用目的：为了实现向用户提供基于用户位置的地图展示、定位、搜索服务
收集个人信息：位置信息（经纬度、精确位置、粗略位置）【通过IP 地址、GNSS信息、WiFi状态、WiFi参数、WiFi列表、基站信息、信号强度的信息、蓝牙信息、传感器信息（矢量、加速度、压力、方向、地磁 、陀螺、温度、光敏、nema信号）、设备信号强度信息获取】、设备标识信息（IMEI、IDFA、IDFV、Android ID、MEID、MAC地址、OAID、IMSI、硬件序列号）、当前应用信息（应用名、应用版本号）、设备参数及系统信息（系统属性、设备型号、操作系统）。
使用场景：用户使用定位相关功能时使用
合作方主体：高德软件有限公司
收集方式：SDK采集
合作方官网链接：https://lbs.amap.com/
合作方隐私政策：https://lbs.amap.com/pages/privacy/
百度语音识别（ASR）
SDK类型：语音识别
SDK描述：将音频流实时识别为文字，并返回每句话的开始和结束时间
SDK使用业务场景：实时语音输入
SDK所需用户信息字段：网络权限，文件读取权限
SDK使用目的、理由：对用户输入地址信息等时通过语音识别简化用户输入操作，提高用户体验。主要用于下单时输入客户地址信息，采用原生集成后，封装桥接文件供js端调用的方式.
官方网站：http://ai.baidu.com/
百度文字识别（OCR）
SDK类型：文字识别
SDK描述：文字检测和识别
SDK使用业务场景：身份证、行驶证识别
SDK所需用户信息字段：网络权限，相机权限，文件读取权限，读取相册权限
SDK使用目的、理由：对用户实名认证时通过文字识别简化用户输入操作，提高用户体验主要用于身份证信息识别，采用原生集成后，封装桥接文件供js端调用的方式
官方网站：http://ai.baidu.com/
极光推送
涉及个人信息：设备标识符（Android如IMEI、Android ID、OAID、IMSI、ICCID、MEID，iOS如IDFV、IDFA）、MAC地址、IP地址、地理位置、SimSerialNumber和运营商信息

使用目的：帮助提升推送消息触达和保障系统运行稳定
合作方主体：深圳市和讯华谷信息技术有限公司
合作方官网链接：https://www.jiguang.cn/push?source=bdAd&plan=1&unit=18&keyword=244&bd_vid=10960636148519080981
合作方隐私政策：https://www.jiguang.cn/license/privacy
友盟 umengSDK 社会化分享
涉及个人信息：设备标识符（Android如IMEI、Android ID、Serial、IMSI、OPENUDID、GUID、ICCID，iOS如IDFV、IDFA）、MAC地址、设备传感器数据、IMEI、设备MAC地址、软件安装列表、位置、联系人、通话记录、日历、短信、本机电话号。图片、音视频
使用目的：分享图片或链接
使用场景：在用户使用App时使用
合作方主体：北京锐讯灵通科技有限公司、友盟同欣（北京）科技有限公司、浙江阿里巴巴云计算有限公司、北京缔元信互联网数据技术有限公司等
收集方式：SDK采集
合作方官网链接：https://developer.umeng.com/docs/147377/detail/210024
合作方隐私政策：https://developer.umeng.com/docs/147377/detail/209997
智齿客服 SDK
涉及个人信息：设备标识符、Android ID、操作系统类型、系统版本、App包名、App版本、设备类型、设备厂商、设备型号、屏幕尺寸、网络类型
使用目的：识别网络状态及账号异常状态、了解产品及服务的适配性
使用场景：使用人工客服
合作方主体：智齿科技
收集方式：SDK采集
合作方官网链接：https://www.sobot.com
合作方隐私政策：https://www.sobot.com/clause.html
小米 PUSH
涉及个人信息：设备标识符（如IMEI、Android ID、MEID、Serial、OAID）、WLAN接入点
使用目的：推送消息
使用场景：在小米手机终端推送消息时使用

合作方主体：北京小米移动软件有限公司
收集方式：SDK采集
合作方官网链接：https://dev.mi.com/console/appservice/push.html
合作方隐私政策：https://dev.mi.com/console/doc/detail?pId=1822
VIVO PUSH （Android）
涉及个人信息：设备信息
使用目的：推送消息
使用场景：在VIVO手机终端推送消息时使用
合作方主体：广东天宸网络科技有限公司及将来受让运营vivo开放平台的公司
收集方式：SDK采集
合作方官网链接：https://dev.vivo.com.cn/documentCenter/doc/366
OPPO PUSH （Android）
涉及个人信息：设备标识符（如IMEI号、SIM卡序列号、IMSI、Android ID、GAID）、应用信息（如应用包名、版本号和运行状态）、网络信息（如IP或域名连接结果、当前网络类型）
使用目的：推送消息
使用场景：在OPPO手机终端推送消息时使用
合作方主体：广东欢太科技有限公司
收集方式：SDK采集
合作方官网链接：https://open.oppomobile.com/wiki/doc#id=10194
合作方隐私政策：https://open.oppomobile.com/wiki/doc#id=10288
魅族 PUSH （Android）
涉及个人信息：设备标识符（如IMEI、Serial）、MAC地址、IP地址、WLAN接入点
使用目的：推送消息
使用场景：在魅族手机终端推送消息时使用
合作方主体：珠海市魅族通讯设备有限公司及其关联方（简称魅族）、与魅族建立合作的合作方公司
收集方式：SDK采集
合作方官网链接：https://open.flyme.cn/open-web/views/push.html
合作方隐私政策：https://www.meizu.com/legal.html
华为 PUSH （Android）
涉及个人信息：应用匿名标识（AAID）、应用Token、应用列表

使用目的：推送消息
使用场景：在华为手机终端推送消息时使用
合作方主体：华为软件技术有限公司
收集方式：SDK采集
合作方官网链接：https://developer.huawei.com/consumer/cn/doc/app/20213
合作方隐私政策：https://developer.huawei.com/consumer/cn/doc/development/HMSCore-Guides/privacy-statement-0000001050042021
上海奇虎 SDK （Android）
涉及个人信息：设备标识符、Android ID、操作系统类型、系统版本、App包名、App版本、设备类型、设备厂商、设备型号
使用目的：对app进行安全加固
使用场景：app加固
合作方主体：智齿科技
收集方式：SDK采集
合作方官网链接：https://jiagu.360.cn/#/global/index
合作方隐私政策：https://jiagu.360.cn/#/global/help/32
SDK名称：个推SDK
使用目的：用于提供消息推送技术服务
使用场景：我们在向您推送消息时，我们可能会授权每日互动股份有限公司进行链路调节，相互促活被关闭的SDK推送进程，保障您可以及时接收到我们向您推送的消息
收集个人信息类型：唯一设备识别码（如IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息）设备Mac地址、设备平台、设备厂商、设备品牌、应用列表信息；运营商、设备的网络状态和变化，位置相关信息、蓝牙状态、IP 地址、Wifi信息(Wifi信息)、MAC地址(MAC地址)、BSSID、SSID、chromium；剪贴板内容、软件安装列表、运行时的进程信息等设备信息
隐私政策链接：https://docs.getui.com/privacy
百度 OCPX 转化追踪应用 SDK
涉及个人信息：硬件型号，操作系统版本及系统情况， 设备配置，国际移动设备身份码 IMEI、国际移动用户识别码 IMSI、网络设备硬 件地址 MAC、供应商标识符 IDFV、匿名设备标识符 OAID、Android ID 等设备标识符、设备连接信息(例如浏览器的类型、电信运营商、使用的语言、WIFI 信息)以及设备状态信息(例如设备应用安装列表)

使用目的：统计用户转化率
合作方主体：百度
收集方式：SDK采集
合作方官网链接：https://dev2.baidu.com/home
合作方隐私政策：https://ocpx-devcenter.bj.bcebos.com/videoworks/console-upload/【百度oCPX应用SDK转化追踪工具】隐私政策.pdf?authorization=bce-auth-v1/e2ea496b5e7f4e20bd0e5d1ce5533588/2022-03-02T07%3A26%3A49Z/-1/host/a457d9fc218b82a94f1a1209ed821931c1f7703ffe40bd220ba25ce5e42f8056
QQ 互联（腾讯开放平台）
使用目的：为用户提供QQ三方登录功能，帮助用户分享内容至QQ
个人信息字段：设备标识符（Android如IMEI、Android ID、IMSI，iOS如IDFV）、MAC地址、IP地址、位置信息（如GPS）
所属机构：深圳市腾讯计算机系统有限公司
官网链接：https://open.tencent.com/
隐私保护说明：https://wiki.connect.qq.com/qq%E4%BA%92%E8%81%94sdk%E9%9A%90%E7%A7%81%E4%BF%9D%E6%8A%A4%E5%A3%B0%E6%98%8E
腾讯bugly
使用目的：云平台、企业协作、辅助运营
个人信息字段：日志信息（包括：第三方开发者自定义日志、Logcat日志以及APP崩溃堆栈信息）、设备ID（包括：Android_id 以及 IDFV）、联网信息、系统名称、系统版本以及国家码
所属机构：深圳市腾讯计算机系统有限公司
隐私保护说明：https://privacy.qq.com/document/preview/fc748b3d96224fdb825ea79e132c1a56
阿里云推送
使用目的：推送消息
个人信息类型：设备识别信息
所属机构：阿里云计算有限公司
官网链接：https://www.aliyun.com/product/cps?utm_content=se_1009556542
② 日志信息
根据相关法律法规要求，同时，为了统计本平台的用户使用情况，优化本平台的产品与 / 或服务，为您提供更好的服务体验，当您使用本平台时，我们会自动收集您使用本平台的详细信息并作为网络日志进行保存， 包括浏览记录、加购记录、订单信息、网络诊断、卡顿信息、点击事件、关卡成功或失败情况、浏览记录和点击记录并根据相关法律要求进行保存。
3，您充分知晓，以下情形中，我们收集、使用个人信息无需征得您的授权同意：
1 ） 与国家安全、国防安全有关的；
2 ） 与公共安全、公共卫生、重大公共利益有关的；
3 ） 与犯罪侦查、起诉、审判和判决执行等有关的；
4 ） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
5 ） 所收集的个人信息是个人信息主体自行向社会公众公开的；
6 ） 从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
7 ） 根据您的要求签订合同所必需的；
8 ） 用于维护所提供的产品与 / 或服务的安全稳定运行所必需的，例如发现、处置产品与 / 或服务的故障；
9 ） 为合法的新闻报道所必需的；
10 ） 学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
11 ） 法律法规规定的其他情形。
三、我们如何共享、转让、公开披露您的个人信息
因收集你的信息是为了向你提供服务及提升服务质量的目的，为了实现这一目的，我们会把你的信息用于下列用途：
1.向你提供你使用的各项服务，并维护、改进这些服务。
2.我们可能使用你的个人信息以预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护你、其他我们用户，或我们或其关联方的合法权益。
3.经你许可的其他用途。
①共享
我们对你的信息承担保密义务，不会与餐修以外的任何公司、组织和个人分享您的信息，我们以下情况除外：
1.在获取明确同意的情况下共享:获得您的明确同意后,我们会与其他方共享您的个人信息。
2.我们可能会根据法律法规规定，或按政府主管部门的强制性要求,对外共享您的个人信息。
3.与我们的关联公司共享：您的个人信息可能会与餐修的关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的,将再次征求您的授权同意。
4.向可信赖的合作伙伴提供你的个人信息，让他们根据我们的指示并遵循我们的隐私权政策以及其他任何相应的保密和安全措施来为我们处理这些信息。
5.如你是适合的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷。
6.如你出现违反中国有关法律、法规或者餐修用户端相关协议或相关规则的情况，需要向第三方披露。
7.为维护餐修用户端及其关联方或用户的合法权益。
如我们委托第三方处理您的个人信息的，我们将会与受托人约定委托处理的目的、期限、处理方式、个人信息的种类、保护措施以及双方的权利和义务等，并对受托人的个人信息处理活动进行监督。如果我们与第三方个人信息处理者共同决定您个人信息的处理目的和处理方式的，将与合作商约定各自的权利和义务，且该约定不影响您向其中任何一个个人信息处理者要求行使您的权利，若侵害您的个人信息权益造成损害的，我们将依法承担连带责任。
我们将对个人信息的共享活动事先进行个人信息保护影响评估，对输出形式、流转、使用等采取有效的技术保护措施。在合作协议层面，严格要求合作商的信息保护义务与责任，与业务合作商在合作前签署关于数据安全的保护协议。
②转让
转让是指将个人信息控制权向其他公司、组织或个人转移的过程。未经过您的同意，我们不会将您的个人信息转让。
③.公开披露
除符合法律法规的规定进行公开披露或获得您单独同意外，我们不会公开披露您未自行公开或者其他未合法公开的个人信息。且在我们公开披露您的个人信息前会进行个人信息保护影响评估，并采用符合行业内标准的安全保护措施进行处理。
在如下情况下，我们将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：
（1）经您事先同意，向第三方披露；
（2）为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；
（3）根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
（4）如您出现违反中国有关法律、法规或者餐修用户端服务协议或相关规则的情况，需要向第三方披露；
（5）如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
（6）在餐修产品/服务上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，我们合同相对义务向该用户提供其交易对方的联络方式或其他通信必要信息，以促成交易的完成或纠纷的解决。
（7）其它餐修用户端版本根据法律、法规或者网站政策认为合适的披露。

四、我们如何使用Cookie 和同类技术
为使你获得更轻松的访问体验，你访问餐修用户端相关网站或使用餐修用户端提供的服务时，我们可能会通过小型数据文件识别你的身份，这么做是帮你省去重复输入注册信息的步骤，或者帮助判断你的账户安全。这些数据文件可能是Cookie，FlashCookie，或你的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。
请你理解，我们的某些服务只能通过使用“Cookie”才可得到实现。如果你的浏览器或浏览器附加服务允许，你可以修改对Cookie的接受程度或者拒绝餐修用户端的Cookie，但这一举动在某些情况下可能会影响你安全访问餐修用户端相关网站和使用餐修用户端提供的服务。
网页上常会包含一些电子图象（称为"单像素"GIF文件或"网络beacon"），使用网络beacon可以帮助网站计算浏览网页的用户或访问某些cookie，我们会通过网络beacon收集你浏览网页活动的信息，例如你访问的页面地址、你先前访问的援引页面的位址、你停留在页面的时间、你的浏览环境以及显示设定等。
五、信息存储与保护
4.1信息储存
餐修用户端收集的有关你的信息和资料将保存在餐修用户端及（或）其关联公司的服务器上，这些信息和资料可能传送至你所在国家、地区或餐修用户端收集信息和资料所在地并在该地被访问、存储和展示。
4.2信息保护
为保障你的信息安全，我们努力采取各种合理的物理、电子和管理方面的安全措施来保护你的信息，使你的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到你的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制， 与他们签署保密协议，监控他们的操作情况等措施。餐修用户端会按现有技术提供相应的安全措施来保护你的信息，提供合理的安全保障，餐修用户端将尽力做到使你的信息不被泄漏、毁损或丢失。
你的账户均有安全保护功能，请妥善保管你的账户及密码信息。餐修用户端将通过向其它服务器备份、对用户密码进行加密等安全措施确保你的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请你理解在信息网络上不存在“完善的安全措施”。
在使用餐修用户端服务进行网上交易时，你不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请你妥善保护自己的个人信息，仅在必要的情形下向他人提供。如你发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请你立即联络餐修用户端客服，以便餐修用户端采取相应措施。
六、未成年人保护
我们的产品和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。 对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。 尽管当地法律和习俗对儿童的定义不同，但我们将不满 14 周岁的任何人均视为儿童。 如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
七、您的权利
按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
访问您的个人信息 您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问： 如果您希望访问或编辑您的账户中的个人资料信息、更改您的密码或关闭您的账户、修改常用地址等，您可以通过“餐修客户端”的“我的-设置”功能执行此类操作。
删除您的个人信息 在以下情形中，您可以向我们提出删除个人信息的请求：
如果我们处理个人信息的行为违反法律法规；
如果我们收集、使用您的个人信息，却未征得您的同意；
如果我们处理个人信息的行为违反了与您的约定；
如果您不再使用我们的产品或服务，或您注销了账号； 
如果我们不再为您提供产品或服务。 若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。 当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
个人信息主体注销账户 您随时可注销此前注册的账户，您可以通过联系我们的客服人员要求为您注销账户。 在收到注销账户申请7个工作日之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
响应您的上述请求 对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
 在以下情形中，按照法律法规要求，我们将无法响应您的请求：
与国家安全、国防安全有关的；
与公共安全、公共卫生、重大公共利益有关的；
与犯罪侦查、起诉和审判等有关的；
有充分证据表明您存在主观恶意或滥用权利的；
响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。
八、本隐私权政策如何更新
我们可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在我们网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后的7日后生效。如您在隐私权政策调整或变更后继续使用我们提供的任一服务或访问我们相关网站的，我们相信这代表您已充分阅读、理解并接受修改后的隐私权政策并受其约束。
九、如何联系我们
如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们联系：
电话：19157668838
一般情况下，我们将在七个工作日内回复您。
该文档编辑于:2023年4月25日
				</pre>
		</view>

	</view>
</template>

<script>
	export default {
		data() {
			return {
				fontSize: 25
			};
		},
		methods: {
			fontSizeHandle(type) {
				
				if (type == 'big') {
					this.fontSize = this.fontSize + 5
				} else {
					if(this.fontSize==5 )return
					
					this.fontSize = this.fontSize - 5
				}
			}
		}
	}
</script>

<style lang="scss" scoped>
	.main {
		width: 100%;
		white-space: normal;
	}

	.btn {
			    display: flex;
			    justify-content: end;
		.btns {
			display: flex;
			width:30%;
			justify-content: end;
		}
	}

	pre {
		white-space: pre-wrap;
		/*css-3*/
		white-space: -moz-pre-wrap;
		/*Mozilla,since1999*/
		white-space: -pre-wrap;
		/*Opera4-6*/
		white-space: -o-pre-wrap;
		/*Opera7*/
		word-wrap: break-word;
		/*InternetExplorer5.5+*/
	}
</style>
